
let newsData = [{ "timee": "2021/1/18 21:40", "B线润叶加水流量": "282.1480408", "B线润叶回风温度蒸汽阀开度": "37.86562729", "B线润叶注入蒸汽流量": "356.8424683", "B线润叶前温度仪实际值": "13.85995293", "B线润叶回风温度": "59.48884964", "field9": "", "B线加料入口蒸汽阀门开度": "37.83335495", "叶片B线TBL注入蒸汽流量实际值": "357.1402283", "B线加料加水瞬时流量": "6.118939877", "叶片B加料机出口温度[℃]": "44.77430344", "field14": "", "燃烧炉出口工艺气温度实际值": "160.7093353", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:41", "B线润叶加水流量": "281.8987427", "B线润叶回风温度蒸汽阀开度": "37.86562729", "B线润叶注入蒸汽流量": "356.2027588", "B线润叶前温度仪实际值": "13.97569466", "B线润叶回风温度": "59.48455811", "field9": "", "B线加料入口蒸汽阀门开度": "37.83335495", "叶片B线TBL注入蒸汽流量实际值": "357.1678772", "B线加料加水瞬时流量": "6.030930042", "叶片B加料机出口温度[℃]": "45.12152863", "field14": "", "燃烧炉出口工艺气温度实际值": "160.8425293", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:42", "B线润叶加水流量": "282.1262512", "B线润叶回风温度蒸汽阀开度": "37.86562729", "B线润叶注入蒸汽流量": "355.5766907", "B线润叶前温度仪实际值": "14.00463009", "B线润叶回风温度": "59.47889328", "field9": "", "B线加料入口蒸汽阀门开度": "37.83335495", "叶片B线TBL注入蒸汽流量实际值": "356.6428528", "B线加料加水瞬时流量": "5.929947853", "叶片B加料机出口温度[℃]": "44.81481552", "field14": "", "燃烧炉出口工艺气温度实际值": "160.9452667", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:43", "B线润叶加水流量": "281.8983459", "B线润叶回风温度蒸汽阀开度": "37.86562729", "B线润叶注入蒸汽流量": "355.0704041", "B线润叶前温度仪实际值": "14.09143543", "B线润叶回风温度": "59.4774704", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "355.074707", "B线加料加水瞬时流量": "5.956357956", "叶片B加料机出口温度[℃]": "45.08102036", "field14": "", "燃烧炉出口工艺气温度实际值": "160.9031067", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:44", "B线润叶加水流量": "281.8291321", "B线润叶回风温度蒸汽阀开度": "37.86562729", "B线润叶注入蒸汽流量": "354.4298401", "B线润叶前温度仪实际值": "14.09143543", "B线润叶回风温度": "59.47295761", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "355.4335938", "B线加料加水瞬时流量": "6.136081219", "叶片B加料机出口温度[℃]": "44.90740967", "field14": "", "燃烧炉出口工艺气温度实际值": "160.7601929", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:45", "B线润叶加水流量": "281.8891602", "B线润叶回风温度蒸汽阀开度": "38", "B线润叶注入蒸汽流量": "354.5414734", "B线润叶前温度仪实际值": "13.68634224", "B线润叶回风温度": "59.46194458", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "355.7422485", "B线加料加水瞬时流量": "6.075293064", "叶片B加料机出口温度[℃]": "44.72222137", "field14": "", "燃烧炉出口工艺气温度实际值": "160.6077118", "风选出口水分仪水分实际值": "-0.636869669" }
    ,
{ "timee": "2021/1/18 21:46", "B线润叶加水流量": "281.6723633", "B线润叶回风温度蒸汽阀开度": "38", "B线润叶注入蒸汽流量": "354.9223633", "B线润叶前温度仪实际值": "14.26504707", "B线润叶回风温度": "59.44200134", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "355.0469666", "B线加料加水瞬时流量": "5.998293877", "叶片B加料机出口温度[℃]": "44.98263931", "field14": "", "燃烧炉出口工艺气温度实际值": "160.5102081", "风选出口水分仪水分实际值": "-0.636237264" }
    ,
{ "timee": "2021/1/18 21:48", "B线润叶加水流量": "281.8811646", "B线润叶回风温度蒸汽阀开度": "38", "B线润叶注入蒸汽流量": "354.6959839", "B线润叶前温度仪实际值": "14.26504707", "B线润叶回风温度": "59.42156219", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "354.2283936", "B线加料加水瞬时流量": "6.066781044", "叶片B加料机出口温度[℃]": "45.04050827", "field14": "", "燃烧炉出口工艺气温度实际值": "160.5825043", "风选出口水分仪水分实际值": "-0.636191607" }
    ,
{ "timee": "2021/1/18 21:49", "B线润叶加水流量": "282.1520386", "B线润叶回风温度蒸汽阀开度": "38", "B线润叶注入蒸汽流量": "355.7903748", "B线润叶前温度仪实际值": "14.12036991", "B线润叶回风温度": "59.41550064", "field9": "", "B线加料入口蒸汽阀门开度": "37.89466095", "叶片B线TBL注入蒸汽流量实际值": "354.2781067", "B线加料加水瞬时流量": "6.030038834", "叶片B加料机出口温度[℃]": "44.94213104", "field14": "", "燃烧炉出口工艺气温度实际值": "160.6856232", "风选出口水分仪水分实际值": "-0.636570454" }
    ,
{ "timee": "2021/1/18 21:50", "B线润叶加水流量": "282.0549927", "B线润叶回风温度蒸汽阀开度": "38", "B线润叶注入蒸汽流量": "356.7135925", "B线润叶前温度仪实际值": "14.32291698", "B线润叶回风温度": "59.41007996", "field9": "", "B线加料入口蒸汽阀门开度": "38", "叶片B线TBL注入蒸汽流量实际值": "354.9930725", "B线加料加水瞬时流量": "6.018240929", "叶片B加料机出口温度[℃]": "45.08680344", "field14": "", "燃烧炉出口工艺气温度实际值": "160.6989441", "风选出口水分仪水分实际值": "-0.634634674" }
];

let newMain = document.querySelector('.new-main');//新闻容器
let pagination = document.querySelector('.pagination');//分页容器
let pageCount = Math.ceil(newsData.length / 5); //根据数据的长度计算总共几页
let newsDataRender = [];//每页要显示的数据
let p = 1;//根据p值显示每页的数据

//渲染页面函数
let render = () => {
    newMain.innerHTML = ' ';
    newsDataRender = newsData.slice((p - 1) * 5, 5 * p); //每页要显示的数据,一页显示5条
    newsDataRender.forEach((item, index) => {
        newMain.innerHTML += ` <div class="item">
    <div class="item-title">${item.timee}</div>
    <div class="item-content">
        ${item.B线润叶加水流量}    </div>
</div>`;
    });
};
//初始化页面
render();

//渲染分页
for (let i = 1; i <= pageCount; i++) {
    pagination.innerHTML += `<a>${i}</a>`;
}
pagination.innerHTML += `<span class="skip">跳转至 <input type="text"> </span>页`;//获取页数
let asAll = pagination.querySelectorAll('a');
//页面刚进来时第一页高亮
asAll[p - 1].classList.add('active');

//遍历总页数
asAll.forEach((item, index) => {
    //点击页数
    item.onclick = function () {
        for (let j = 0; j < asAll.length; j++) {
            asAll[j].classList.remove('active');
        }
        this.classList.add('active');
        p = index + 1; //点击页数，改变p的值，以改变这个页面要显示的数据，达到分页的效果
        render(); //重新渲染页面
    }
});
//点击上一页下一页，改变高亮
let changePageClass = () => {
    for (let j = 0; j < asAll.length; j++) {
        asAll[j].classList.remove('active');
    }
    asAll[p - 1].classList.add('active');
};
//上一页
let prev = document.querySelector('.prev');
prev.onclick = function (e) {
    if (p <= 1) {
        console.log(p);
        return;
    } else {
        p = p - 1;
        changePageClass();
        render();
    }
};
//下一页
let next = document.querySelector('.next');
next.onclick = function () {
    if (p >= asAll.length) {
        return;
    }
    p = p + 1;
    changePageClass();
    render();
}

